{
	"social": {
		"Github": "https://github.com/jamesm2w/",
		"Glitch": "https://glitch.com/@jamesm2w",
		"Youtube": "https://www.youtube.com/channel/UCoGBLBgShbsbhj5yCejLDUQ",
		"Instagram": "https://www.instagram.com/jamesm2w/",
		"Panthers Youtube": "https://www.youtube.com/channel/UCR0UIJsLc3hAIIZ1w_fN7vw",
		"Panthers Instagram": "https://www.instagram.com/panthers4x4/"
	},
	"projects": [
		{
			"name": "Travellers Mod (Worlds Adrift)",
			"date": "Ongoing",
			"link": {"Github Source": "https://github.com/Fureniku/Travellers"},
			"description": "After the end of Worlds Adrift in July 2019 a fan-made project to recreate elements of the game in Minecraft began, working under the pseudonym Travellers - the original working title of Worlds Adrift. My role on the project is working on implementing the knowledge and schematic systems."
		},
		{
			"name": "UK Elections Hex Map",
			"date": "December 2019",
			"link": {"Website": "https://jamesm2w.github.io/uk-hexes/", "Github Source": "https://jamesm2w.github.io/uk-hexes/"},
			"media": {
				"type": "image",
				"url": "images/image_hexmap.png"
			},
			"description": "View the results for the past 3 UK General Elections and Parliamentary By-Elections as single-area hexagons coloured by winning party, majority, and turnout. Sources: UK HoC Library (Results), ODI Leeds (Hex Layout)"
		}, 
		{
			"name": "UK Petition Data Viewer",
			"date": "September 2019",
			"link": {"Website": "https://jamesm2w.github.io/uk-petition/", "Github Source": "https://github.com/jamesm2w/uk-petition"},
			"description": "Displays UK Parliament petition data by country, constituency. See also totals for MPs by party and percentages of each field."
		},
		{
			"name": "TheNewStudent",
			"date": "November 2019",
			"link": {"Github Source": "https://github.com/jamesm2w/TheNewStudent"},
			"description": "A mock-up social network for students allowing users to register, joing class groups, complete homework set by teachers and engage with a real-time chat application."
		},
		{
			"name": "Panthers - 4x4 in Schools Competiton",
			"date": "March 2019",
			"link": "",
			"description": "Building a functioning 4x4 remote controlled car from scratch and programming a control system which allows 4 wheel steering, throttle control, daylight activated headlights, tilt sensor, and an active suspension for tilt correction."
		},
		{
			"name": "Panthers (Website)",
			"date": "January 2019",
			"link": {"Website": "https://thspanthers.com/"},
			"description": "An advertisment/portfolio site which highlights the Panthers team's achievements and provides an opportunity for potential sponsers to get in contact."
		},
		{
			"name": "Engine Roller (Worlds Adrift)",
			"date": "2018",
			"link": {"Website": "https://engine-roller.glitch.me/", "Github Source": "https://github.com/jamesm2w/engine-roller"},
			"description": "A speculative project which randomly generates schematics similar to those which appear in Worlds Adrift. Special Thanks to Ziwix (Random Algorithm) and Machine Maker (Schematic names) for their help."
		},
		{
			"name": "WANN/WAAC (Worlds Adrift)",
			"date": "2016",
			"link": {"Soundcloud": "https://soundcloud.com/wan-on-air-official", "Github Archive": "https://github.com/jamesm2w/WANN-Audio-Archive"},
			"description": "A podcast/newscast project recorded weekly based about news in the Worlds Adrift game. I was involved in editing the show, thanks also go to: MeisterKeen (Voice), Vick Viper (Voice), Louthinator (Voice), Mattcus (Editing, Music) as well as any guests which appeared on the show."
		},
		{
			"name": "Snake Game 2",
			"date": "2017",
			"link": {"Website": "https://snake-game2.glitch.me/"},
			"description": "Networked HTML5 + JS game like the traditional 'Snake' play against friends, select your colour + name. Built upon a glitch project called snake-game, I added colour support in this version."
		},
		{
			"name": "Multi-User Chat",
			"date": "2018",
			"link": {"Website": "https://user-chat.glitch.me/"},
			"description": "Networked chat application using socket.io events. Doesn't keep message history or any user data."
		},
		{
			"name": "5 Card Draw (Website)",
			"date": "2019",
			"link": {"Website": "https://5carddraw.glitch.me/"},
			"description": "Roll 5 cards, discard any amount and redraw. Hand will be scored against poker rules. Python version available in Card Engine."
		},
		{
			"name": "Card Engine (Python)",
			"date": "2019",
			"link": {"Github Source": "https://github.com/jamesm2w/CardEngine"},
			"description": "Simple scripts to represent cards, decks and hands in python. Includes algorithms for scoring hands against 5-card poker rules, shuffling cards, drawing from the deck as well as discarding. Web version also available."
		},
		{
			"name": "Voice Commands",
			"date": "2018",
			"link": {"Website": "https://voice-commands.glitch.me/"},
			"description": "An experiment with the experimental WebAPI for speech to text. A few different commands recognised (similar to a voice assistant), recommended to use Google Chrome, other browsers may not support."
		},
		{
			"name": "Godhand Discord Bot (Worlds Adrift)",
			"date": "2018",
			"link": "",
			"description": "Node.JS server which runs a program which connects to discord to read and send messages. This particular one was built for helping users and moderators in the Worlds Adrift discord chat."
		},
		{
			"name": "Misc. Discord Bots",
			"date": "2016-2019",
			"link": "",
			"description": "An assortment of discord bots to provide a variety of functionalities. wa-server-bot: show game server statuses in discord. countdown: counts towards a set time. invite-generator: generates unique one time invites to keep servers private. discord-role: add's a role to every member of a server."
		}
		
	]
}